<template lang="md">
# 投稿ガイドライン<hr>
このページでは 譜面の投稿時の注意事項について説明します

## 譜面の長さ
1~3分前後が無難です。フルサイズでなくショートサイズを推奨します。
あまり長いと譜面のネタが尽きて作成が難しくなったり、プレイする側が力尽きて完走できなくなります。
### 例
2:00
<br>

## title
楽曲のタイトルを入れましょう。CDとして発売されたことがある曲の場合はその表記を入れてください。
アーティスト名/グループ名は別途欄があるので分けましょう。
### 例
散々なんだよ、この空は
<br>

## artists
楽曲のアーティスト名を入れましょう。音楽配信サイトなどで配信されていた場合はその表記を使いましょう。
### 例
soundorbis
<br>

## author
譜面の作成者名を入れましょう。一般的には自分の名前を入れますが、内容に合わせたジョーク等入れても構わないです。
複数人で作った場合はグループ名にするか、全員分表記するかご自由にどうぞ。
### 例
霜月(そうげつ)
<br>

## genre
一覧の中から一番それらしいジャンルを選びましょう。どれにも当てはまらない場合のみgeneralを指定してください。
### 例
general
<br>

## description
譜面の内容や楽曲の内容などに関して何かコメントを入れましょう。必須入力になっていますが、何も思いつかなければ`コメントなし`と入れておいてください。
### 例
趣向を変えてフリー素材で作ってみました。この曲、なんでフリーなんですかね？お金取ってもいいと思うんですけど
<br>

## difficulty
譜面の難易度を選んでください。1~50の50段階になっていますが、基準はPJSekai本家そのものとしています。
明らかに本家より難しい場合は、それ以上の難易度を設定してください。
### 例
31
<br>

## jacket
楽曲のジャケットを入れましょう。自分の作成した楽曲でない場合は配布サイト等に記載されたジャケットを使うのが無難です。
### 例
<img src="https://i.ytimg.com/vi/FZIfoFrk8m8/hqdefault.jpg" alt="ジャケット画像の例">
<br>

## music
楽曲の音源を入れましょう。音ズレが発生しないように気をつけましょう。
### 例
music.mp3
<br>

## level.json
sus2sonolusで変換した出力ファイルを選択してください。それ以外のものが選択された場合、Sonolus上でプレイすることができません。
### 例
[https://file.io/dB5oRaPT8CV8](https://file.io/dB5oRaPT8CV8)
<br>
</template>

<script>
export default {
  head () {
    return {
      title: '創作譜面ガイドライン'
    }
  }
}
</script>
