<template lang="md">
# 創作譜面の遊び方<hr>
このページでは 投稿された譜面を実際に遊ぶ方法を解説します。

## iPhone/iPadの方
<iframe width="560" height="315" src="https://www.youtube.com/embed/qMUdLv69T7Q" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>
<br>

こちらの動画を参考に進めてください。
途中で入力を促されるサーバーアドレスについては下記を参照してください。

## Androidの方
[Sonolus公式サイト](https://sonolus.com/)のAndroidアイコンから APKをダウンロードしてください。
本体に悪影響を与える場合があると表示されますが、__自己責任で保存してください(ストア内のどのアプリにも言えることです)__
次にダウンロードしたAPKを開き、警告が出たら [設定→この提供元のアプリを許可](https://sp7pc.com/google/android/5065#toc3) してください。
許可したら、APKをもう一度開き、インストールが最後まで完了したらアプリ準備完了です。
アプリ起動後は上記動画同様に進めてください。
途中で入力を促されるサーバーアドレスについては下記を参照してください。
<br>

## サーバーアドレス<hr>
本サイトの譜面一覧を取得するためにはサーバーアドレスを登録する必要があります。

### 一般用 サーバーアドレス
本サーバーのメインアドレスは **https://sweetpotato.sonolus.jp** です。
このアドレスを入力すれば公開状態のすべての譜面を一覧表示できます

### 企画用 サーバーアドレス
Discordなどに記載があるサーバーアドレスを入力すると
特定の企画の譜面のみを一覧表示できます

### テストプレイ用 サーバーアドレス
創作譜面投稿者の方は ユーザーページに記載のある個別のURLをサーバーとして登録することで
全体公開前の譜面をテストプレイすることができます。
譜面個別のURLを他者に教えると全体公開前にプレイしてもらうこともできます。

<br>

## サーバー内絞り込み<hr>
本サーバーではサーバー内で絞り込みをサポートしています

### ジャンル絞り込み
<サーバーアドレス>/<ジャンル名>
で 指定したジャンルの譜面のみを取得できます
対応ジャンルは以下の通りです
- all(すべて)
- jpop(J-POP)
- anime(アニメ)
- vocaloid(ボカロ)

<br>

### 難易度絞り込み
<サーバーアドレス>/<ジャンル名>/<難易度>
で 指定した難易度の譜面のみを取得できます
対応難易度は以下の通りです
- all(すべて)
- easy(簡単)
- normal(普通)
- hard(難しい)
- extream(かなり難しい)
- hell(地獄)
<br>

### サーバー内絞り込みの例
**https://sweetpotato.sonolus.jp/anime/normal**
ジャンルが アニメ かつ 難易度が 普通 の譜面のみを表示します

**https://sweetpotato.sonolus.jp/all/hell**
ジャンルが すべて かつ 難易度が 地獄 の譜面のみを表示します

<br>

## 検索クエリ絞り込み<hr>
本サーバーでは検索クエリでの絞り込みをサポートしています

### ジャンル絞り込み
検索時に genre:<ジャンル名> で 指定ジャンルのみの絞り込みが可能です

### 難易度絞り込み
検索時に rating:難易度 で 指定した範囲の難易度で絞り込みが可能です
難易度の指定は "5-10" "10-20" "20-30" のように指定してください

### 検索クエリ絞り込みの例
**Daydream genre:anime**
Daydream という単語が含まれる アニメの譜面のみを表示します

**Daydream genre:anime rating:10-20**
Daydream という単語が含まれる 難易度が10-20の譜面のみを表示します

</template>
