<template lang="md">
# 創作譜面の遊び方<hr>
このページでは 投稿された譜面を実際に遊ぶ方法を解説します。

## iPhone/iPadの方
<iframe width="348vw" max-width="100%" height="315" src="https://www.youtube.com/embed/qMUdLv69T7Q" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>
<br>

こちらの動画を参考に進めてください。
途中で入力を促されるサーバーアドレスについては下記を参照してください。

## Androidの方
[Sonolus公式サイト](https://sonolus.com/)のAndroidアイコンから APKをダウンロードしてください。
本体に悪影響を与える場合があると表示されますが、__自己責任で保存してください(ストア内のどのアプリにも言えることです)__
次にダウンロードしたAPKを開き、警告が出たら [設定→この提供元のアプリを許可](https://sp7pc.com/google/android/5065#toc3) してください。
許可したら、APKをもう一度開き、インストールが最後まで完了したらアプリ準備完了です。
アプリ起動後は上記動画同様に進めてください。
途中で入力を促されるサーバーアドレスについては下記を参照してください。
<br>

## サーバーアドレス<hr>
本サイトの譜面一覧を取得するためにはサーバーアドレスを登録する必要があります。

### 一般用 サーバーアドレス
本サーバーのメインアドレスは **https://servers.purplepalette.net** です。このアドレスを入力すれば公開状態のすべての譜面を一覧表示できます

### テストプレイ用 サーバーアドレス
譜面を投稿する際、譜面を全体公開前にテストプレイする機能があります。ユーザーページに記載のある**https://servers.purplepalette.net/tests/kafuuchino** という形式のアドレスをSonolusで入力し、選択することでテストプレイできます。
公開前に他の人にテストしてもらいたい場合はこのアドレスを共有することで試してもらうことができます。何らかの理由でアドレスを変えたい場合は、変更することも可能です。
※テストプレイ用アドレスからはテスト状態のすべての譜面がプレイできます、1つのみを共有することはできません。

### ユーザー個別 サーバーアドレス
特定のユーザーの投稿した譜面のみを表示したい場合ユーザー個別アドレスが便利です。
**https://servers.purplepalette.net/users/hoge** のようにサーバーアドレス欄に入れると
指定したユーザーの譜面のみを表示することができます。
※現在ユーザーIDが表示されていないため機能していません、実装をお待ち下さい
<br>

## 検索クエリ<hr>
本サーバーでは検索クエリでのソートと絞り込みをサポートしています

### ソート
検索時に `sort:<ソート方法>` または `s:<ソート方法>` で
指定した方法で並べ替えることができます。
#### 対応ソート方法
- createdDate
  - 譜面の登録日でソートします
  - 代わりに `c` と略しても機能します
- updatedDate
  - 譜面の更新日でソートします
  - 代わりに `u` と略しても機能します
- rating
  - 譜面の難易度でソートします
  - 代わりに `r` と略しても機能します
- name
  - 譜面の名前(ID)でソートします
  - 代わりに `n` と略しても機能します

### ジャンル絞り込み
検索時に `genre:<ジャンル名>` で 指定ジャンルのみの絞り込みが可能です

### 難易度絞り込み
検索時に `rating:難易度` で 指定した範囲の難易度で絞り込みが可能です
難易度の指定は `5-` `-10` `20-30` `1204` のように指定してください

### 検索クエリの例
**Daydream genre:anime**
Daydream という単語が含まれる アニメの譜面のみを表示します

**Daydream genre:anime rating:10-20**
Daydream という単語が含まれる 難易度が10-20の譜面のみを表示します

</template>

<script>
export default {
  head () {
    return {
      title: '創作譜面の遊び方'
    }
  }
}
</script>
